message = "Hello, World!"  # 定义一个变量，名为message，并赋值为字符串"Hello, World!"
print(message)   # 输出变量message的值，即"Hello, World!"

# ----------------------------------------------------------------------------
# 注意：变量名是区分大小写的；变量的类性质是动态的，即可以在运行时改变变量的类型；变量名不能以数字开头，不能包含空格和特殊字符（如@、#、$等），但可以使用下划线（_）作为分隔符。
# 注意：变量名应该具有描述性，以便于理解和维护。
# 注意：变量的类型可以是多种类型，如整数、浮点数、字符串、列表、字典等。Python是一种动态类型语言，这意味着你不需要在声明变量时指定其类型，Python会根据赋值自动推断类型。
# ----------------------------------------------------------------------------


print(message.title())  # 输出变量message的值，并将字符串的首字母大写，即"Hello, World!"

# ----------------------------------------------------------------------------
info = f"{message}"  # 使用f-string格式化字符串，将变量message的值嵌入到字符串中
print(info)  # 输出变量info的值

# ----------------------------------------------------------------------------
# 变量的作用域：在Python中，变量的作用域分为全局和局部两种。全局变量是在函数外部定义的变量，可以在整个程序中访问；局部变量是在函数内部定义的变量，只能在函数内部访问。
# ----------------------------------------------------------------------------
print("Python")
print("\tPython")  # 使用制表符\t进行缩进
print("Languages:\nPython\nC\nJavaScript")  # 使用换行符\n进行换行
# ----------------------------------------------------------------------------

stir = "  Python  "  # 定义一个字符串变量stir，并赋值为带有前后空格的字符串"  Python  "
print(stir)  # 输出变量stir的值，即"  Python  "
print(stir.lstrip())  # 输出变量stir的值，但去除左侧空格，即"Python  "
print(stir.rstrip())  # 输出变量stir的值，但去除右侧空格，即"  Python"
print(stir.strip())   # 输出变量stir的值，但去除前后空格，即"Python"

# ----------------------------------------------------------------------------
url = "https://www.example.com"  # 定义一个字符串变量url，并赋值为一个URL字符串
print(url)  # 输出变量url的值，即"https://www.example.com"
print(url.startswith("https"))  # 输出变量url是否以"https"开头，即True
print(url.endswith(".com"))  # 输出变量url是否以".com"结尾，即True
print(url.removeprefix("https://"))  # 输出变量url去除前缀"https://"后的值，即"www.example.com"
print(url.removesuffix(".com"))  # 输出变量url去除后缀".com"后的值，即"https://www.example"
# ----------------------------------------------------------------------------
print("Python" + " " + "is" + " " + "awesome!")  # 使用字符串拼接输出"Python is awesome!"

print("Python" * 3)  # 使用字符串重复输出"PythonPythonPython"
# ----------------------------------------------------------------------------
print(2 + 3)  # 输出整数2和3的和，即5
print(2 - 3)  # 输出整数2和3的差，即-1
print(2 * 3)  # 输出整数2和3的积，即6
print(2 / 3)  # 输出整数2和3的商，即0.6666666666666666
print(2 // 3)  # 输出整数2和3的整除商，即0
print(2 % 3)  # 输出整数2和3的余数，即2
x,y,z = 2,3,4  # 定义三个变量x、y、z，并分别赋值为2、3、4
# ----------------------------------------------------------------------------
ABCDEFG = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"  # 定义一个字符串常量ABCDEFG，并赋值为字母表字符串

